(function() {
    'use strict';
    angular
        .module('RegPortal')
        .factory('NsiFactory', [
            NsiFactory
        ]);

    function NsiFactory() {
        return {
            inv: {
                name: "",
                list: [{
                        id: "0",
                        name: "0 - нет инвалидности"
                    },
                    {
                        id: "1",
                        name: "1 - 1 группа"
                    },
                    {
                        id: "2",
                        name: "2 - 2 группа"
                    },
                    {
                        id: "3",
                        name: "3 - 3 группа"
                    },
                    {
                        id: "4",
                        name: "4 - дети-инвалиды"
                    }
                ]
            },
            V006: {
                name: "Классификатор условий оказания медицинской помощи",
                list: [{
                        id: "1",
                        name: "Стационарно"
                    },
                    {
                        id: "2",
                        name: "В дневном стационаре"
                    },
                    {
                        id: "3",
                        name: "Амбулаторно"
                    },
                    {
                        id: "4",
                        name: "Вне медицинской организации"
                    }
                ]
            },
            V008: {
                name: "Классификатор видов медицинской помощи",
                list: [{
                        "id": "1",
                        "name": "Первичная медико-санитарная помощь",
                        "dateStart": "01.01.2011",
                        "dateEnd": ""
                    },
                    {
                        "id": "2",
                        "name": "Скорая, в том числе специализированная, медицинская помощь",
                        "dateStart": "01.01.2011",
                        "dateEnd": ""
                    },
                    {
                        "id": "3",
                        "name": "Специализированная, в том числе высокотехнологичная, медицинская помощь",
                        "dateStart": "01.01.2011",
                        "dateEnd": ""
                    },
                    {
                        "id": "4",
                        "name": "Паллиативная медицинская помощь",
                        "dateStart": "01.01.2013",
                        "dateEnd": ""
                    },
                    {
                        "id": "11",
                        "name": "первичная доврачебная медико-санитарная помощь",
                        "dateStart": "01.01.2013",
                        "dateEnd": ""
                    },
                    {
                        "id": "12",
                        "name": "первичная врачебная медико-санитарная помощь",
                        "dateStart": "01.01.2013",
                        "dateEnd": ""
                    },
                    {
                        "id": "13",
                        "name": "первичная специализированная медико-санитарная помощь",
                        "dateStart": "01.01.2013",
                        "dateEnd": ""
                    },
                    {
                        "id": "21",
                        "name": "скорая специализированная медицинская помощь",
                        "dateStart": "01.01.2013",
                        "dateEnd": ""
                    },
                    {
                        "id": "22",
                        "name": "санитарно-авиационная медицинская помощь",
                        "dateStart": "01.01.2013",
                        "dateEnd": ""
                    },
                    {
                        "id": "31",
                        "name": "специализированная медицинская помощь",
                        "dateStart": "01.01.2013",
                        "dateEnd": ""
                    },
                    {
                        "id": "32",
                        "name": "высокотехнологичная специализированная медицинская помощь",
                        "dateStart": "01.01.2013",
                        "dateEnd": ""
                    }
                ]
            },
            V014: {
                name: "Классификатор условий оказания медицинской помощи",
                list: [{
                        id: "1",
                        name: "Экстренная"
                    },
                    {
                        id: "2",
                        name: "Неотложная"
                    },
                    {
                        id: "3",
                        name: "Плановая"
                    }
                ]
            },
            V021: {
                name: "Классификатор медицинских специальностей",
                list: [{
                        "id": "1",
                        "name": "Авиационная и космическая медицина",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "2",
                        "name": "Акушерство и гинекология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "3",
                        "name": "Аллергология и иммунология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "4",
                        "name": "Анестезиология-реаниматология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "5",
                        "name": "Бактериология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "6",
                        "name": "Вирусология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "7",
                        "name": "Водолазная медицина",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "8",
                        "name": "Гастроэнтерология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "9",
                        "name": "Гематология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "10",
                        "name": "Генетика",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "11",
                        "name": "Гериатрия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "12",
                        "name": "Гигиена детей и подростков",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "13",
                        "name": "Гигиена питания",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "14",
                        "name": "Гигиена труда",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "15",
                        "name": "Гигиеническое воспитание",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "16",
                        "name": "Дезинфектология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "17",
                        "name": "Дерматовенерология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "18",
                        "name": "Детская кардиология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "19",
                        "name": "Детская онкология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "20",
                        "name": "Детская урология-андрология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "21",
                        "name": "Детская хирургия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "22",
                        "name": "Детская эндокринология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "23",
                        "name": "Диетология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "24",
                        "name": "Инфекционные болезни",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "25",
                        "name": "Кардиология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "26",
                        "name": "Клиническая лабораторная диагностика",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "27",
                        "name": "Клиническая фармакология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "28",
                        "name": "Колопроктология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "29",
                        "name": "Коммунальная гигиена",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "30",
                        "name": "Косметология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "31",
                        "name": "Лабораторная генетика",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "32",
                        "name": "Лечебная физкультура и спортивная медицина",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "33",
                        "name": "Мануальная терапия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "34",
                        "name": "Медико-социальная экспертиза",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "35",
                        "name": "Неврология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "36",
                        "name": "Нейрохирургия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "37",
                        "name": "Неонатология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "38",
                        "name": "Нефрология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "39",
                        "name": "Общая врачебная практика (семейная медицина)",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "40",
                        "name": "Общая гигиена",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "41",
                        "name": "Онкология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "42",
                        "name": "Организация здравоохранения и общественное здоровье",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "43",
                        "name": "Ортодонтия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "44",
                        "name": "Остеопатия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "45",
                        "name": "Оториноларингология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "46",
                        "name": "Офтальмология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "47",
                        "name": "Паразитология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "48",
                        "name": "Патологическая анатомия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "49",
                        "name": "Педиатрия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "50",
                        "name": "Пластическая хирургия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "51",
                        "name": "Профпатология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "52",
                        "name": "Психиатрия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "53",
                        "name": "Психиатрия-наркология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "54",
                        "name": "Психотерапия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "55",
                        "name": "Пульмонология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "56",
                        "name": "Радиационная гигиена",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "57",
                        "name": "Радиология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "58",
                        "name": "Радиотерапия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "59",
                        "name": "Ревматология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "60",
                        "name": "Рентгенология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "61",
                        "name": "Рентгенэндоваскулярные диагностика и лечение",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "62",
                        "name": "Рефлексотерапия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "63",
                        "name": "Санитарно-гигиенические лабораторные исследования",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "64",
                        "name": "Сексология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "65",
                        "name": "Сердечно-сосудистая хирургия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "66",
                        "name": "Скорая медицинская помощь",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "67",
                        "name": "Социальная гигиена и организация госсанэпидслужбы",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "68",
                        "name": "Стоматология детская",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "69",
                        "name": "Стоматология общей практики",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "70",
                        "name": "Стоматология ортопедическая",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "71",
                        "name": "Стоматология терапевтическая",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "72",
                        "name": "Стоматология хирургическая",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "73",
                        "name": "Судебно-медицинская экспертиза",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "74",
                        "name": "Судебно-психиатрическая экспертиза",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "75",
                        "name": "Сурдология-оториноларингология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "76",
                        "name": "Терапия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "77",
                        "name": "Токсикология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "78",
                        "name": "Торакальная хирургия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "79",
                        "name": "Травматология и ортопедия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "80",
                        "name": "Трансфузиология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "81",
                        "name": "Ультразвуковая диагностика",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "82",
                        "name": "Управление и экономика фармации",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "83",
                        "name": "Управление сестринской деятельностью",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "84",
                        "name": "Урология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "85",
                        "name": "Фармацевтическая технология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "86",
                        "name": "Фармацевтическая химия и фармакогнозия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "87",
                        "name": "Физиотерапия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "88",
                        "name": "Фтизиатрия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "89",
                        "name": "Функциональная диагностика",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "90",
                        "name": "Хирургия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "91",
                        "name": "Челюстно-лицевая хирургия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "92",
                        "name": "Эндокринология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "93",
                        "name": "Эндоскопия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "94",
                        "name": "Эпидемиология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "95",
                        "name": "Лечебное дело",
                        "dateStart": "07.01.2017",
                        "dateEnd": ""
                    },
                    {
                        "id": "96",
                        "name": "Медико-профилактическое дело",
                        "dateStart": "07.01.2017",
                        "dateEnd": ""
                    },
                    {
                        "id": "97",
                        "name": "Медицинская биохимия",
                        "dateStart": "07.01.2017",
                        "dateEnd": ""
                    },
                    {
                        "id": "98",
                        "name": "Медицинская биофизика",
                        "dateStart": "07.01.2017",
                        "dateEnd": ""
                    },
                    {
                        "id": "99",
                        "name": "Медицинская кибернетика",
                        "dateStart": "07.01.2017",
                        "dateEnd": ""
                    },
                    {
                        "id": "100",
                        "name": "Сестринское дело",
                        "dateStart": "07.01.2017",
                        "dateEnd": ""
                    },
                    {
                        "id": "101",
                        "name": "Фармация",
                        "dateStart": "07.01.2017",
                        "dateEnd": ""
                    },
                    {
                        "id": "206",
                        "name": "Лечебное дело (средний медперсонал)",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "207",
                        "name": "Акушерское дело (средний медперсонал)",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "208",
                        "name": "Стоматология (средний медперсонал)",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "209",
                        "name": "Стоматология ортопедическая",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "210",
                        "name": "Эпидемиология (паразитология)",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "213",
                        "name": "Гигиеническое воспитание",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "215",
                        "name": "Лабораторная диагностика",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "217",
                        "name": "Лабораторное дело",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "219",
                        "name": "Сестринское дело",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "221",
                        "name": "Сестринское дело в педиатрии",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "222",
                        "name": "Операционное дело",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "223",
                        "name": "Анестезиология и реаниматология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "224",
                        "name": "Общая практика",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "226",
                        "name": "Функциональная диагностика",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "227",
                        "name": "Физиотерапия",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "228",
                        "name": "Медицинский массаж",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "230",
                        "name": "Лечебная физкультура",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "231",
                        "name": "Диетология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "233",
                        "name": "Стоматология профилактическая",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "234",
                        "name": "Судебно-медицинская экспертиза",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "280",
                        "name": "Наркология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "281",
                        "name": "Реабилитационное сестринское дело",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "283",
                        "name": "Скорая и неотложная помощь",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    },
                    {
                        "id": "284",
                        "name": "Бактериология",
                        "dateStart": "28.11.2015",
                        "dateEnd": ""
                    }
                ]
            },
            V025: {
                name: "Классификатор целей посещения",
                list: [{
                        id: "1.0",
                        name: "Посещение по заболеванию",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "1.1",
                        name: "Посещениe в неотложной форме",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "1.2",
                        name: "Aктивное посещение",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "1.3",
                        name: "Диспансерное наблюдение",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "2.1",
                        name: "Медицинский осмотр",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "2.2",
                        name: "Диспансеризация",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "2.3",
                        name: "Комплексное обследование",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "2.5",
                        name: "Патронаж",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "2.6",
                        name: "Посещение по другим обстоятельствам",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "3.0",
                        name: "Обращение по заболеванию",
                        dateStart: "01.01.2018"
                    },
                    {
                        id: "3.1",
                        name: "Обращение с профилактической целью",
                        dateStart: "01.01.2018"
                    }
                ]
            },
            F008: {
                name: "Классификатор типов документов, подтверждающих факт страхования по ОМС",
                list: [{
                        id: "1",
                        name: "Полис ОМС старого образца",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "2",
                        name: "Временное свидетельство, подтверждающее оформление полиса обязательного медицинского страхования",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "3",
                        name: "Полис ОМС единого образца",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "4",
                        name: "Состояние на учёте без полиса ОМС",
                        dateStart: "01.01.2014"
                    },
                    {
                        id: "5",
                        name: "Состояние на учёте без временного свидетельства при приёме заявления в иную организацию",
                        dateStart: "01.07.2014"
                    }
                ]
            },
            F011: {
                name: "Классификатор типов документов, удостоверяющих личность",
                list: [{
                        id: "1",
                        name: "Паспорт гражданина СССР",
                        patternSerial: "R-ББ",
                        patternDocument: "999999",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "2",
                        name: "Загранпаспорт гражданина СССР",
                        patternSerial: "S",
                        patternDocument: "00000009",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "3",
                        name: "Свидетельство о рождении, выданное в Российской Федерации",
                        patternSerial: "R-ББ",
                        patternDocument: "999999",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "4",
                        name: "Удостоверение личности офицера",
                        patternSerial: "ББ",
                        patternDocument: "9999999",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "5",
                        name: "Справка об освобождении из места лишения свободы",
                        patternSerial: "S",
                        patternDocument: "00000009",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "6",
                        name: "Паспорт Минморфлота",
                        patternSerial: "ББ",
                        patternDocument: "999999",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "7",
                        name: "Военный билет",
                        patternSerial: "ББ",
                        patternDocument: "9999990",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "8",
                        name: "Дипломатический паспорт гражданина Российской Федерации",
                        patternSerial: "99",
                        patternDocument: "9999999",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "9",
                        name: "Паспорт иностранного гражданина",
                        patternSerial: "S",
                        patternDocument: "000000000009",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "10",
                        name: "Свидетельство о рассмотрении ходатайства о признании иммигранта беженцем на территории Российской Федерации",
                        patternSerial: "S",
                        patternDocument: "000000000009",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "11",
                        name: "Вид на жительство",
                        patternSerial: "S1",
                        patternDocument: "000000000009",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "12",
                        name: "Удостоверение беженца в Российской Федерации",
                        patternSerial: "S",
                        patternDocument: "000000000009",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "13",
                        name: "Временное удостоверение личности гражданина Российской Федерации",
                        patternSerial: "S",
                        patternDocument: "000000000009",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "14",
                        name: "Паспорт гражданина Российской Федерации",
                        patternSerial: "99 99",
                        patternDocument: "9999990",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "15",
                        name: "Заграничный паспорт гражданина Российской Федерации",
                        patternSerial: "99",
                        patternDocument: "9999999",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "16",
                        name: "Паспорт моряка",
                        patternSerial: "ББ",
                        patternDocument: "999990",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "17",
                        name: "Военный билет офицера запаса",
                        patternSerial: "ББ",
                        patternDocument: "999999",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "18",
                        name: "Иные документы",
                        patternSerial: "S1",
                        patternDocument: "0000000009",
                        dateStart: "01.01.2011"
                    },
                    {
                        id: "21",
                        name: "Документ иностранного гражданина",
                        patternSerial: "S1",
                        patternDocument: "000000000009",
                        dateStart: "04.07.2013"
                    },
                    {
                        id: "22",
                        name: "Документ лица без гражданства",
                        patternSerial: "S1",
                        patternDocument: "000000000009",
                        dateStart: "04.07.2013"
                    },
                    {
                        id: "23",
                        name: "Разрешение на временное проживание",
                        patternSerial: "S1",
                        patternDocument: "000000000009",
                        dateStart: "04.07.2013"
                    },
                    {
                        id: "24",
                        name: "Свидетельство о рождении, выданное не в Российской Федерации",
                        patternSerial: "S1",
                        patternDocument: "000000000009",
                        dateStart: "04.07.2013"
                    },
                    {
                        id: "25",
                        name: "Свидетельство о предоставлении временного убежища на территории Российской Федерации",
                        patternSerial: "ЦЦ",
                        patternDocument: "9999999",
                        dateStart: "07.11.2013"
                    },
                    {
                        id: "26",
                        name: "Удостоверение сотрудника Евразийской экономической комиссии",
                        patternSerial: "Ц",
                        patternDocument: "999999",
                        dateStart: "22.11.2013"
                    },
                    {
                        id: "27",
                        name: "Копия жалобы о лишении статуса беженца",
                        patternSerial: "S",
                        patternDocument: "000000000009",
                        dateStart: "23.07.2014"
                    },
                    {
                        id: "28",
                        name: "Иной документ, соответствующий свидетельству о предоставлении убежища на территории Российской Федерации",
                        patternSerial: "S1",
                        patternDocument: "000000000009",
                        dateStart: "15.08.2014"
                    },
                    {
                        id: "29",
                        name: "Трудовой договор",
                        patternSerial: "S1",
                        patternDocument: "000000000009",
                        dateStart: "01.01.2017"
                    },

                ]
            }
        };
    }
})();